/* 2.1 Для однієї з таблиць створити команду отримання значень всіх колонок (явно
перерахувати) у всіх рядках.*/
SELECT 
    equipment_id,
    equipment_name,
    serial_number,
    conclusion,
    customer_id,
    first_appeal
FROM equipment;
/*
EQUIPMENT_ID EQUIPMENT_NAME                                     SERIAL_NUMBER                  CONCLUSION                                                                                                                                                                                                                                                      CUSTOMER_ID FIRST_APPE
------------ -------------------------------------------------- ------------------------------ --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- ----------- ----------
           1 Холодильник SAMSUNG                                RB33J3000SA/UA                 Потрібна діагностика                                                                                                                                                                                                                                                      1           
           2 Холодильник Whirlpool                              F00185264                      Потрібна діагностика                                                                                                                                                                                                                                                      1           
           3 Microwave Bosch                                    B00344744                      Потрібна діагностика                                                                                                                                                                                                                                                      1           
           4 Microwave Noname                                   WB5353354744                   Потрібна діагностика                                                                                                                                                                                                                                                      2 30/01/2022
*/

/* 2.2 Для однієї з таблиць створити команду отримання цілого числа колонки з
використанням будь-якої арифметичної операції. При виведенні на екран визначити для
зазначеної колонки нову назву псевдоніма.*/
SELECT equipment_id AS "equipment ID"
FROM equipment
WHERE equipment_id <= 3;
/*
equipment ID
------------
           1
           2
           3
*/

/* 2.3 Для однієї з таблиць, що містить колонку зовнішнього ключа створити команду
отримання значення колонки без дублювання значень.*/
SELECT DISTINCT customer_id FROM equipment;
/*
CUSTOMER_ID
-----------
          1
          2
*/

/* 2.4 Для однієї з таблиць створити команду отримання результату конкатенації значень будь-
яких двох колонок. При виведенні на початок рядка виведення додати літерал «UNION=».*/
SELECT 'UNION= ' || equipment_name || ' - ' || conclusion AS "RESULT"
   FROM equipment;
/*
RESULT                                                                                                                                                                                                                                                                               
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
UNION= Холодильник SAMSUNG - Потрібна діагностика
UNION= Холодильник Whirlpool - Потрібна діагностика
UNION= Microwave Bosch - Потрібна діагностика
UNION= Microwave Noname - Потрібна діагностика
*/

/* 2.5 Модернізувати рішення завдання 2.2, отримавши в порядку зростання значення
псевдоніму.*/
SELECT 
    equipment_id AS "equipment ID"
FROM equipment
WHERE equipment_id <= 3
ORDER BY equipment_id ASC;
/*
equipment ID
------------
           1
           2
           3
*/
/* 2.6 Для однієї з таблиць створити команду отримання значення двох колонок, значення
яких відсортовані в порядку зростання (для першої колонки) та в порядку зменшення (друга
колонка).*/
SELECT equipment_name, serial_number
FROM equipment
ORDER BY equipment_name ASC, serial_number DESC;
/*
EQUIPMENT_NAME                                     SERIAL_NUMBER                 
-------------------------------------------------- ------------------------------
Microwave Bosch                                    B00344744                     
Microwave Noname                                   WB5353354744                  
Холодильник SAMSUNG                                RB33J3000SA/UA                
Холодильник Whirlpool                              F00185264  
*/