/*
4.1 Для однієї з таблиць створити команду отримання значень всіх колонок (явно
перерахувати) за окремими рядками з урахуванням умови: цілочисельне значення однієї з колонок
має бути більшим за якесь константне значення.
*/
SELECT equipment_id,
    equipment_name,
    serial_number,
    conclusion, 
    customer_id,
    first_appeal
FROM equipment WHERE equipment_id > 2;
/*
4.2 Для однієї з таблиць створити команду отримання значень всіх колонок (явно
перерахувати) за окремими рядками з урахуванням умови: символьне значення однієї з колонок
має співпадати з якимось константним значенням.
*/
SELECT equipment_id,
    equipment_name,
    serial_number,
    conclusion, 
    customer_id,
    first_appeal
FROM equipment WHERE equipment_name = 'Microwave Bosch';
/*
EQUIPMENT_ID EQUIPMENT_NAME                                     SERIAL_NUMBER                  CONCLUSION                                                                                                                                                                                                                                                      CUSTOMER_ID FIRST_APPE
------------ -------------------------------------------------- ------------------------------ --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- ----------- ----------
           3 Microwave Bosch                                    B00344744                      Потрібна діагностика                                                                                                                                                                                                                                                      1           

*/
/*
4.3 Для однієї з таблиць створити команду отримання значень всіх колонок (явно
перерахувати) за окремими рядками з урахуванням умови: символьне значення однієї з колонок
повинно містити в першому та третьому знакомісті якісь надані вами символи.
*/
SELECT equipment_id,
    equipment_name,
    serial_number,
    conclusion, 
    customer_id,
    first_appeal
FROM equipment WHERE equipment_name LIKE 'Microwave%';
/*
EQUIPMENT_ID EQUIPMENT_NAME                                     SERIAL_NUMBER                  CONCLUSION                                                                                                                                                                                                                                                      CUSTOMER_ID FIRST_APPE
------------ -------------------------------------------------- ------------------------------ --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- ----------- ----------
           3 Microwave Bosch                                    B00344744                      Потрібна діагностика                                                                                                                                                                                                                                                      1           
           4 Microwave Noname                                   WB5353354744                   Потрібна діагностика                                                                                                                                                                                                                                                      1 30/01/2022
*/
/*
4.4 У завданні 1.2 було додано колонку типу date. Створити команду отримання значень
всіх колонок (явно перерахувати) за окремими рядками з урахуванням умови: значення доданої
колонки містить невизначене значення.
*/
SELECT equipment_id,
    equipment_name,
    serial_number,
    conclusion, 
    customer_id,
    first_appeal
FROM equipment WHERE first_appeal IS NULL;
/*
EQUIPMENT_ID EQUIPMENT_NAME                                     SERIAL_NUMBER                  CONCLUSION                                                                                                                                                                                                                                                      CUSTOMER_ID FIRST_APPE
------------ -------------------------------------------------- ------------------------------ --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- ----------- ----------
           1 Холодильник SAMSUNG                                RB33J3000SA/UA                 Потрібна діагностика                                                                                                                                                                                                                                                      1           
           2 Холодильник Whirlpool                              F00185264                      Потрібна діагностика                                                                                                                                                                                                                                                      1           
           3 Microwave Bosch                                    B00344744                      Потрібна діагностика                                                                                                                                                                                                                                                      1           
*/
/*
4.5 Створити команду отримання значень всіх колонок (явно перерахувати) за окремими
рядками з урахуванням умови, що поєднує умови з рішень завдань 4.1 та 4.2
*/
SELECT equipment_id,
    equipment_name,
    serial_number,
    conclusion, 
    customer_id,
    first_appeal
FROM equipment WHERE equipment_id > 2 AND equipment_name = 'Microwave Bosch';
/*
EQUIPMENT_ID EQUIPMENT_NAME                                     SERIAL_NUMBER                  CONCLUSION                                                                                                                                                                                                                                                      CUSTOMER_ID FIRST_APPE
------------ -------------------------------------------------- ------------------------------ --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- ----------- ----------
           3 Microwave Bosch                                    B00344744                      Потрібна діагностика                                                                                                                                                                                                                                                      1           

*/
/*
4.6 Створити команду отримання значень всіх колонок (явно перерахувати) за окремими
рядками з урахуванням умови, що інвертує результат рішення 4.5
*/
SELECT equipment_id,
    equipment_name,
    serial_number,
    conclusion, 
    customer_id,
    first_appeal
FROM equipment WHERE NOT equipment_id > 2 AND NOT equipment_name = 'Microwave Bosch';
/*
EQUIPMENT_ID EQUIPMENT_NAME                                     SERIAL_NUMBER                  CONCLUSION                                                                                                                                                                                                                                                      CUSTOMER_ID FIRST_APPE
------------ -------------------------------------------------- ------------------------------ --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- ----------- ----------
           1 Холодильник SAMSUNG                                RB33J3000SA/UA                 Потрібна діагностика                                                                                                                                                                                                                                                      1           
           2 Холодильник Whirlpool                              F00185264                      Потрібна діагностика                                                                                                                                                                                                                                                      1           


*/