/*
6.1 Для однієї з таблиць створити команду отримання кількості рядків таблиці.
*/
SELECT COUNT(*) FROM equipment
/*
  COUNT(*)
----------
         4
*/
/*
6.2 Для однієї з таблиць створити команду отримання суми значень однієї з цілих
колонок.
*/
SELECT SUM(equipment_id)
FROM equipment;
/*
SUM(EQUIPMENT_ID)
-----------------
               10
*/
/*
6.3 Для однієї з таблиць створити команду отримання статистики появи значень однієї з
колонок у таблиці, наприклад:
- значення 1, кількість появи значення 1
- значення 2, кількість появи значення 2
*/
SELECT conclusion, COUNT(*)
FROM equipment
GROUP BY conclusion
/*
CONCLUSION               COUNT(*)                                                                                                                                                                                                                                      
-------------------------------------
Потрібна діагностика        2                                                                                                                                                                                                                                          

*/
/*
6.4 Модифікувати рішення попереднього завдання так, щоб у відповіді були
відфільтровані рядки з урахуванням заданої умови, що включає використану функцію агрегації.
*/
SELECT conclusion, COUNT(*)
FROM equipment
GROUP BY conclusion
HAVING COUNT(*) > 1;
/*
CONCLUSION               COUNT(*)                                                                                                                                                                                                                                      
-------------------------------------
Потрібна діагностика        2                                                                                                                                                                                                                                          

*/