/*
1. Одна з колонок таблиць повинна містити строкове значення з двома словами,
розділеними пробілом. Виконайте команду UPDATE, помінявши місцями ці два слова.
*/
SELECT
    equipment_name original,
    REGEXP_REPLACE(equipment_name, '^(\w+)(.*?)(\w+)$', '\3\2\1') replaced
FROM equipment
WHERE
    equipment_id = 1;
/*
ORIGINAL
--------------------------------------------------
REPLACED                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Холодильник SAMSUNG                                
SAMSUNG Холодильник   
*/
/*
2. Одна з колонок таблиць має містити строкове значення з електронною поштовою
адресою у форматі EEE@EEE.EEE.UA, де E – будь-яка латинська буква. Створіть запит,
вилучення логіна користувача з електронної адреси (підстрока перед символом @).
*/
SELECT REGEXP_REPLACE(email, '\@.*$') login
FROM customer;
/*
LOGIN                                                                           
--------------------------------------------------------------------------------
kolya.geshko
kolya.geshko
*/
/*
3. Одна з колонок таблиць повинна містити строкове значення з номером мобільного
телефону у форматі +XX(XXX)XXX-XX-XX, де X – цифра. Виконайте команду UPDATE,
додавши перед номером телефону фразу «Mobile:».
*/
UPDATE customer c
   SET phone_number = REPLACE(phone_number, phone_number, 'Mobile: ' || phone_number);

SELECT phone_number FROM customer;
/*
PHONE_NUMBER                                      
--------------------------------------------------
Mobile: +38(066)424-13-34
Mobile: +38(063)661-95-13
Mobile: +38(063)666-96-96
Mobile: +38(063)666-96-77
Mobile: +38(063)167-96-11
Mobile: +38(012)345-67-89
*/
/*
4. Додайте до колонки з електронною адресою обмеження цілісності, що забороняє
вносити дані, відмінні від формату електронної адреси, використовуючи команду ALTER TABLE
таблиця ADD CONSTRAINT обмеження CHECK (умова). Перевірте роботу обмеження на двох
прикладах UPDATE-запитів із правильними та неправильними значеннями колонки.
*/
ALTER TABLE customer
ADD CONSTRAINT format_email CHECK (email LIKE '%@%.%' AND email NOT LIKE '@%' AND email NOT LIKE '%@%@%')

UPDATE customer
SET email = 'hello'
WHERE customer_id = 3;
/*
Error starting at line : 1 in command -
UPDATE customer
SET email = 'hello'
WHERE customer_id = 3
Error report -
ORA-02290: check constraint (HESHKO.FORMAT_EMAIL) violated
*/

UPDATE customer
SET email = 'hello@gmail.com'
WHERE customer_id = 3;
-- 1 row updated.
/*
5. Видаліть зайві дані з колонки з номером мобільного телефону, залишивши тільки номер
телефону в заданому форматі.
*/
UPDATE customer 
  SET phone_number = regexp_replace(
        phone_number,
    '(.+)\s(.+)',
    '\2');

SELECT phone_number
FROM customer;
/*
PHONE_NUMBER                                      
--------------------------------------------------
+38(066)424-13-34
+38(063)661-95-13
+38(063)666-96-96
+38(063)666-96-77
+38(063)676-16-76
+38(012)345-67-89
*/
/*
6. Додайте в колонку з мобільним телефоном обмеження цілісності, що забороняє вносити
дані, відмінні від формату, записаного в завданні 3. Перевірте роботу обмеження на двох
прикладах UPDATE-запитів із правильними та неправильними значеннями колонки.
*/
ALTER TABLE customer
ADD CONSTRAINT format_phone CHECK (regexp_like(phone_number, '\+[0-9]+\([0-9]+\)[0-9]+-[0-9]+-[0-9]+'))

UPDATE customer
SET phone_number = '0636629593'
WHERE customer_id = 3;
/*
Error report -
ORA-02290: check constraint (HESHKO.FORMAT_PHONE) violated
*/
UPDATE customer
SET phone_number = '+38(063)662-95-93'
WHERE customer_id = 3;
/*
1 row updated.
*/