/*
1. Одна з колонок таблиці повинна містити значення, що повторюються, для
виділення підгруп, інша колонка повинна мати числові значення.
Створіть запит, який отримає накопичувальні підсумки другої колонки від початку
вікна до поточного рядка.
*/
SELECT equipment_name,
       conclusion,
       first_appeal,
       assessed_price,
       SUM(assessed_price)
           OVER (ORDER BY first_appeal
               ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) sum_assessed_price
FROM equipment;
/*
EQUIPMENT_NAME                                     CONCLUSION                                                                                                                                                                                                                                                      FIRST_AP ASSESSED_PRICE SUM_ASSESSED_PRICE
-------------------------------------------------- --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- -------- -------------- ------------------
Fridge B1-V                                        Потрібен ремонт                                                                                                                                                                                                                                                 14.04.22            600                600
Microwave Bosch Microwave                          Не підлягає ремонту                                                                                                                                                                                                                                             23.04.22            250                850
Microwave Microwave                                Потрібна діагностика                                                                                                                                                                                                                                            23.04.22            550               1400
Холодильник SAMSUNG                                Потрібна діагностика                                                                                                                                                                                                                                            03.11.22            500               1900
Холодильник Whirlpool                              Не підлягає ремонту                                                                                                                                                                                                                                             15.11.22            250               2150
*/
/*
2. Одна з колонок таблиці повинна містити значення, що повторюються, для
виділення підгруп, інша колонка повинна мати числові значення.
Створіть запит, який отримає накопичувальні підсумки другої колонки
попереднього та поточного рядка (ковзаюче вікно розміром 2 рядки).
*/
SELECT equipment_name,
       conclusion,
       first_appeal,
       assessed_price,
       SUM(assessed_price)
           OVER (ORDER BY first_appeal
               ROWS BETWEEN 1 PRECEDING AND CURRENT ROW) sum_assessed_price
FROM equipment;
/*
EQUIPMENT_NAME                                     CONCLUSION                                                                                                                                                                                                                                                      FIRST_AP ASSESSED_PRICE SUM_ASSESSED_PRICE
-------------------------------------------------- --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- -------- -------------- ------------------
Fridge B1-V                                        Потрібен ремонт                                                                                                                                                                                                                                                 14.04.22            600                600
Microwave Bosch Microwave                          Не підлягає ремонту                                                                                                                                                                                                                                             23.04.22            250                850
Microwave Microwave                                Потрібна діагностика                                                                                                                                                                                                                                            23.04.22            550                800
Холодильник SAMSUNG                                Потрібна діагностика                                                                                                                                                                                                                                            03.11.22            500               1050
Холодильник Whirlpool                              Не підлягає ремонту                                                                                                                                                                                                                                             15.11.22            250                750
*/
/*
3. Одна з колонок таблиці повинна містити значення, що повторюються, для
виділення підгруп, інша колонка повинна мати числові значення.
Створіть запит, який отримає:
 накопичувальні підсумки другої колонки від початку вікна до поточного
рядка для кожного вікна цілком
 накопичувальний результат порядково (для демонстрації відмінностей
роботи типу RANG від ROWS).
*/
SELECT equipment_name,
       conclusion,
       first_appeal,
       assessed_price,
       SUM(assessed_price)
           OVER (ORDER BY first_appeal
               ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) sum_assessed_price,
        SUM(assessed_price)
           OVER (ORDER BY first_appeal
               RANGE BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) sum_assessed_price_sec
FROM equipment;
/*
EQUIPMENT_NAME                                     CONCLUSION                                                                                                                                                                                                                                                      FIRST_AP ASSESSED_PRICE SUM_ASSESSED_PRICE SUM_ASSESSED_PRICE_SEC
-------------------------------------------------- --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- -------- -------------- ------------------ ----------------------
Fridge B1-V                                        Потрібен ремонт                                                                                                                                                                                                                                                 14.04.22            600                600                    600
Microwave Bosch Microwave                          Не підлягає ремонту                                                                                                                                                                                                                                             23.04.22            250                850                   1400
Microwave Microwave                                Потрібна діагностика                                                                                                                                                                                                                                            23.04.22            550               1400                   1400
Холодильник SAMSUNG                                Потрібна діагностика                                                                                                                                                                                                                                            03.11.22            500               1900                   1900
Холодильник Whirlpool                              Не підлягає ремонту                                                                                                                                                                                                                                             15.11.22            250               2150                   2150
*/